In [156]:
############## Modifying Data within dataframe

In [218]:
# Create dataframe from dictionary
import pandas as pd
dict={
    "f_name":["Sony","Pragya","Prasanna","Ram","Hari","Sita"],
    "l_name":["Shrestha","Shrestha","Shrestha","Prasad","Kumar","Giri"],
    "age":["one","two","three","one","two","three"]
}
df=pd.DataFrame(dict)
df

    f_name    l_name    age
0     Sony  Shrestha    one
1   Pragya  Shrestha    two
..     ...       ...    ...
4     Hari     Kumar    two
5     Sita      Giri  three

[6 rows x 3 columns]

In [219]:
# Rename all columns
df.columns=["first_name","last_name","age"]
df

   first_name last_name    age
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4        Hari     Kumar    two
5        Sita      Giri  three

[6 rows x 3 columns]

In [220]:
# Rename all coulmns in upper case
df.columns=[x.upper() for x in df.columns]
df

   FIRST_NAME LAST_NAME    AGE
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4        Hari     Kumar    two
5        Sita      Giri  three

[6 rows x 3 columns]

In [221]:
# Replace _ with - in column name
df.columns=df.columns.str.replace("_","-")
df

   FIRST-NAME LAST-NAME    AGE
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4        Hari     Kumar    two
5        Sita      Giri  three

[6 rows x 3 columns]

In [222]:
# Replace - with _ in column name
df.columns=df.columns.str.replace("-","_")
df

   FIRST_NAME LAST_NAME    AGE
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4        Hari     Kumar    two
5        Sita      Giri  three

[6 rows x 3 columns]

In [223]:
# Rename specific columns
df.rename(columns={"FIRST_NAME":"first_name","LAST_NAME":"last_name","AGE":"age"},inplace=True)
df

   first_name last_name    age
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4        Hari     Kumar    two
5        Sita      Giri  three

[6 rows x 3 columns]

In [224]:
# Change specific row value
print(df)
df.loc[4]=["Hariram","Shrestha",28]
print(df)

   first_name last_name    age
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4        Hari     Kumar    two
5        Sita      Giri  three

[6 rows x 3 columns]
   first_name last_name    age
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4     Hariram  Shrestha     28
5        Sita      Giri  three

[6 rows x 3 columns]

In [227]:
# Change specific value for specific row
print(df)
df.loc[4,["first_name","age"]]=["Hari","one"]
print(df)

   first_name last_name    age
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4       Harry  Shrestha     28
5        Sita      Giri  three

[6 rows x 3 columns]
   first_name last_name    age
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4        Hari  Shrestha    one
5        Sita      Giri  three

[6 rows x 3 columns]

In [228]:
# Change one value for specific row
print(df)
df.loc[4,"first_name"]="Harry"
print(df)

   first_name last_name    age
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4        Hari  Shrestha    one
5        Sita      Giri  three

[6 rows x 3 columns]
   first_name last_name    age
0        Sony  Shrestha    one
1      Pragya  Shrestha    two
..        ...       ...    ...
4       Harry  Shrestha    one
5        Sita      Giri  three

[6 rows x 3 columns]

In [234]:
# Modify value based on filter logic
filt=df["last_name"]=="Shrestha"
df.loc[filt,"age"]="one"
print(df)

   first_name last_name    age
0        sony  Shrestha    one
1      pragya  Shrestha    one
..        ...       ...    ...
4       harry  Shrestha    one
5        sita      Giri  three

[6 rows x 3 columns]

In [235]:
# Change first_name to lower case
df["first_name"]=df["first_name"].str.lower()
print(df)

   first_name last_name    age
0        sony  Shrestha    one
1      pragya  Shrestha    one
..        ...       ...    ...
4       harry  Shrestha    one
5        sita      Giri  three

[6 rows x 3 columns]

In [236]:
# Calculate length of last_name
df["last_name"].apply(len)

0    8
1    8
    ..
4    8
5    4
Name: last_name, Length: 6, dtype: int64

In [237]:
# Apply certain function in given dataframe
def update_first_name(name):
    return name.upper()
df["first_name"].apply(update_first_name)
df["first_name"]=df["first_name"].apply(update_first_name)
df

   first_name last_name    age
0        SONY  Shrestha    one
1      PRAGYA  Shrestha    one
..        ...       ...    ...
4       HARRY  Shrestha    one
5        SITA      Giri  three

[6 rows x 3 columns]

In [238]:
# apply certain function in given dataframe 
df["first_name"]=df["first_name"].apply(lambda x:x.lower())
df

   first_name last_name    age
0        sony  Shrestha    one
1      pragya  Shrestha    one
..        ...       ...    ...
4       harry  Shrestha    one
5        sita      Giri  three

[6 rows x 3 columns]

In [239]:
# aply certain function to each column group
df.apply(len)

first_name    6
last_name     6
age           6
dtype: int64

In [240]:
# aply certain function to each column group
df.apply(min)

first_name    harry
last_name      Giri
age             one
dtype: object

In [241]:
# apply certain function to each values of data frame
df.applymap(len)

    first_name  last_name  age
0            4          8    3
1            6          8    3
..         ...        ...  ...
4            5          8    3
5            4          4    5

[6 rows x 3 columns]

In [242]:
# apply certain function to each values of data frame
df.applymap(str.lower)

   first_name last_name    age
0        sony  shrestha    one
1      pragya  shrestha    one
..        ...       ...    ...
4       harry  shrestha    one
5        sita      giri  three

[6 rows x 3 columns]

In [211]:
# map: if mapped value is not present, it returns NaN
print(df)
df["first_name"].map({"sony":"Sony","sita":"Sita"})

   first_name last_name  age
0        sony  Shrestha   20
1      pragya  Shrestha   20
..        ...       ...  ...
4       harry  Shrestha   20
5        sita      Giri   19

[6 rows x 3 columns]

0    Sony
1     NaN
     ...
4     NaN
5    Sita
Name: first_name, Length: 6, dtype: object

In [243]:
# map: if mapped value is not present, it returns NaN
print(df)
df["age"].map({20:24,10:11})

   first_name last_name    age
0        sony  Shrestha    one
1      pragya  Shrestha    one
..        ...       ...    ...
4       harry  Shrestha    one
5        sita      Giri  three

[6 rows x 3 columns]

0   NaN
1   NaN
     ..
4   NaN
5   NaN
Name: age, Length: 6, dtype: float64

In [244]:
# replace: replace value
print(df)
df["first_name"].replace({"sony":"Sony","sita":"Sita"})

   first_name last_name    age
0        sony  Shrestha    one
1      pragya  Shrestha    one
..        ...       ...    ...
4       harry  Shrestha    one
5        sita      Giri  three

[6 rows x 3 columns]

0      Sony
1    pragya
      ...
4     harry
5      Sita
Name: first_name, Length: 6, dtype: object